app/Views/admin/antrian.php

SELECT *
FROM `pasien`
WHERE `nik` = '352546756455'
 LIMIT 1
SELECT *
FROM `rekam_medis`
WHERE `nomor_antrian` = '1'
 LIMIT 1
---
                        <?php foreach ($antrian as $a):

                            $pasienModel = new \App\Models\PasienModel();
                            $pasien = $pasienModel->where('nik', $a['nik'])->first();
                            $rekamMedisModel = new \App\Models\RMModel();
                            $rekam = $rekamMedisModel->where('nomor_antrian', $a['nomor_antrian'])->first();