app/Controllers/AgamaController.php

    public function index()
    {
        $agama = $this->agamaModel->findAll();
---
SELECT *
FROM `agama`