app/Controllers/AntrianController.php

    public function index()
    {

        $rekamMedis = $this->rekamMedisModel
            ->select('rekam_medis.*, pasien.nama AS nama_pasien, pasien.tanggal_lahir, tb_dokter.nama AS nama_dokter, antrian.id AS antrian_id')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id', 'left')
            ->join('tb_dokter', 'rekam_medis.dokter_id = tb_dokter.id', 'left')
            ->join('antrian', 'rekam_medis.id = antrian.rm_id', 'left')
            ->orderBy('antrian.id', 'DESC')
            ->findAll();
---
SELECT `rekam_medis`.*, `pasien`.`id_pasien`, `pasien`.`nama_lengkap` AS `nama_pasien`, `pasien`.`tanggal_lahir`, `dokter`.`nama` AS `nama_dokter`, `antrian`.`id_antrian` AS `antrian_id`, `penyakit`.`nama_penyakit`, `tindakan`.`nama_tindakan`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id_pasien`
LEFT JOIN `dokter` ON `rekam_medis`.`dokter_id` = `dokter`.`id_dokter`
LEFT JOIN `penyakit` ON `rekam_medis`.`penyakit_id` = `penyakit`.`id_penyakit`
LEFT JOIN `tindakan` ON `rekam_medis`.`tindakan_id` = `tindakan`.`id_tindakan`
LEFT JOIN `antrian` ON `rekam_medis`.`id_rm` = `antrian`.`rm_id`
ORDER BY `antrian`.`id_antrian` DESC