app/Controllers/AntrianController.php

SELECT `rekam_medis`.*, `pasien`.`nama` AS `nama_pasien`, `pasien`.`tanggal_lahir`, `tb_dokter`.`nama` AS `nama_dokter`
FROM `rekam_medis`
JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id`
LEFT JOIN `tb_dokter` ON `rekam_medis`.`dokter_id` = `tb_dokter`.`id`
SELECT `antrian`.*, `rekam_medis`.`no_rm`
FROM `antrian`
JOIN `rekam_medis` ON `antrian`.`rm_id` = `rekam_medis`.`id`
WHERE DATE(antrian.tanggal_periksa) = '2025-03-09'
---
    public function index()
    {

        $rekamMedis = $this->rekamMedisModel
            ->select('rekam_medis.*, pasien.nama AS nama_pasien, pasien.tanggal_lahir, tb_dokter.nama AS nama_dokter')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id')
            ->join('tb_dokter', 'rekam_medis.dokter_id = tb_dokter.id', 'left')
            ->findAll();

        $antrian = $this->antrianModel
            ->select('antrian.*, rekam_medis.no_rm')
            ->join('rekam_medis', 'antrian.rm_id = rekam_medis.id')
            ->where('DATE(antrian.tanggal_periksa)', date('Y-m-d'))
            ->findAll();

INSERT INTO `antrian` (`nik`, `nomor_antrian`, `tanggal_periksa`, `status_pemeriksaan`, `status_bayar`, `tarif`, `created_at`, `updated_at`) VALUES ('238475928378', 3, '2025-01-23', 'menunggu', 'belum lunas', 0, '2025-01-23 17:31:35', '2025-01-23 17:31:35')
---
    public function ambilAntrian()
    {
        $nik = $this->request->getPost('nik');
        $pasien = $this->PasienModel->getPasienByNik($nik);
        $tanggal = Time::now('Asia/Jakarta', 'Y-m-d H:i:s');

        if ($pasien) {
            // Periksa jumlah antrian pada tanggal yang sama
            $lastAntrian = $this->antrianModel
                ->where('tanggal_periksa', $tanggal)
                ->orderBy('nomor_antrian', 'DESC')
                ->first();

            // Jika belum ada antrian untuk hari ini, mulai dari 1
            $no_antrian = $lastAntrian ? $lastAntrian['nomor_antrian'] + 1 : 1;

            // Tambah data antrian baru
            $this->antrianModel->insert([
                'nik' => $nik,
                'nomor_antrian' => $no_antrian,
                'tanggal_periksa' => $tanggal,
                'status_pemeriksaan' => 'menunggu',
                'status_bayar' => 'belum lunas',
                'tarif' => 0,
            ]);

UPDATE `antrian` SET `status_bayar` = 'belum lunas', `updated_at` = '2025-01-23 17:32:46'
WHERE `antrian`.`id` IN ('3')
---
    public function ubahStatusBayar($id)
    {
        $status = $this->request->getPost('status_bayar');
        $this->antrianModel->update($id, ['status_bayar' => $status]);