app/Controllers/AntrianController.php

SELECT `rekam_medis`.*, `pasien`.`id_pasien`, `pasien`.`nama_lengkap` AS `nama_pasien`, `pasien`.`tanggal_lahir`, `dokter`.`nama` AS `nama_dokter`, `antrian`.*, `resep`.`status_resep`, `penyakit`.`nama_penyakit`, `tindakan`.`nama_tindakan`, `tindakan`.`harga` AS `harga_tindakan`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id_pasien`
LEFT JOIN `dokter` ON `rekam_medis`.`dokter_id` = `dokter`.`id_dokter`
LEFT JOIN `penyakit` ON `rekam_medis`.`penyakit_id` = `penyakit`.`id_penyakit`
LEFT JOIN `tindakan` ON `rekam_medis`.`tindakan_id` = `tindakan`.`id_tindakan`
LEFT JOIN `antrian` ON `rekam_medis`.`id_rm` = `antrian`.`rm_id`
LEFT JOIN `resep` ON `rekam_medis`.`id_rm` = `resep`.`rm_id`
WHERE DATE(rekam_medis.tanggal_periksa) = '2025-05-29'
ORDER BY `antrian`.`id_antrian` DESC
SELECT `resep`.*, `obat`.`nama_obat`, `obat`.`harga`
FROM `resep`
LEFT JOIN `obat` ON `obat`.`id_obat` = `resep`.`obat_id`
WHERE `rm_id` = '30'
ORDER BY `tanggal_resep` DESC
---
    public function index()
    {
        // Ambil data rekam medis lengkap
        $rekamMedisRaw = $this->rekamMedisModel
            ->select('rekam_medis.*, pasien.id_pasien, pasien.nama_lengkap AS nama_pasien, pasien.tanggal_lahir, dokter.nama AS nama_dokter, antrian.*, resep.status_resep, penyakit.nama_penyakit, tindakan.nama_tindakan, tindakan.harga AS harga_tindakan')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id_pasien', 'left')
            ->join('dokter', 'rekam_medis.dokter_id = dokter.id_dokter', 'left')
            ->join('penyakit', 'rekam_medis.penyakit_id = penyakit.id_penyakit', 'left')
            ->join('tindakan', 'rekam_medis.tindakan_id = tindakan.id_tindakan', 'left')
            ->join('antrian', 'rekam_medis.id_rm = antrian.rm_id', 'left')
            ->join('resep', 'rekam_medis.id_rm = resep.rm_id', 'left')
            ->where('DATE(rekam_medis.tanggal_periksa)', date('Y-m-d'))
            ->orderBy('antrian.id_antrian', 'DESC')
            ->findAll();

        $rekamMedis = [];
        $resepPasien = [];

        foreach ($rekamMedisRaw as $rekam) {
            $rekamMedis[$rekam['id_rm']] = $rekam;

            // Ambil resep berdasarkan id_rm (rekam medis)
            $resepList = $this->resepModel
                ->select('resep.*, obat.nama_obat, obat.harga')
                ->join('obat', 'obat.id_obat = resep.obat_id', 'left')
                ->where('rm_id', $rekam['id_rm'])
                ->orderBy('tanggal_resep', 'DESC')
                ->findAll();

SELECT `antrian`.*, `pasien`.`nama_lengkap`, `rekam_medis`.`no_rm`, `rekam_medis`.`penyakit_id`, `rekam_medis`.`tindakan_id`
FROM `antrian`
JOIN `pasien` ON `pasien`.`id_pasien` = `antrian`.`pasien_id`
LEFT JOIN `rekam_medis` ON `rekam_medis`.`id_rm` = `antrian`.`rm_id`
WHERE DATE(antrian.tanggal_periksa) = '2025-05-29'
ORDER BY `antrian`.`nomor_antrian` ASC
SELECT *
FROM `penyakit`
SELECT *
FROM `tindakan`
---
        }

        // Ambil antrian hari ini
        $antrian = $this->antrianModel
            ->select('antrian.*, pasien.nama_lengkap, rekam_medis.no_rm, rekam_medis.penyakit_id, rekam_medis.tindakan_id')
            ->join('pasien', 'pasien.id_pasien = antrian.pasien_id')
            ->join('rekam_medis', 'rekam_medis.id_rm = antrian.rm_id', 'left')
            ->where('DATE(antrian.tanggal_periksa)', date('Y-m-d'))
            ->orderBy('antrian.nomor_antrian', 'ASC')
            ->findAll();

        // Ambil semua data penyakit dan tindakan
        $penyakitList = $this->penyakitModel->findAll();
        $tindakanList = $this->tindakanModel->findAll();

SELECT *
FROM `resep`
WHERE `rm_id` = '30'
ORDER BY `tanggal_resep` DESC
 LIMIT 1
---
            $a['harga_tindakan'] = $tindakanMap[$a['tindakan_id']]['harga'] ?? 0;

            // Ambil status resep (jika ada)
            $resep = $this->resepModel
                ->where('rm_id', $a['rm_id'])
                ->orderBy('tanggal_resep', 'DESC')
                ->first();

SELECT *
FROM `pembayaran`
---

        // Data pembayaran
        $caraPembayaranOptions = $this->pembayaranModel->getCaraPembayaranEnum();
        $pembayaran = $this->pembayaranModel->findAll();

SELECT *
FROM `antrian`
WHERE `antrian`.`id_antrian` = '27'
SELECT *
FROM `resep`
WHERE `rm_id` = '30'
---
    public function bayar()
    {
        $id_antrian = $this->request->getPost('id_antrian');
        $tarif = $this->request->getPost('tarif');
        $uang_dibayar = $this->request->getPost('uang_dibayar');
        $no_bayar = $this->request->getPost('no_bayar');
        // dd($tarif);

        // Ambil data antrian untuk dapatkan pasien_id dan rm_id
        $antrian = $this->antrianModel->find($id_antrian);
        if (!$antrian) {
            return redirect()->back()->with('error', 'Data antrian tidak ditemukan.');
        }

        $pasien_id = $antrian['pasien_id'];
        $rekam_id  = $antrian['rm_id'];

        // Ambil data tindakan dari rekam medis
        $rekam = $this->rekamMedisModel->find($rekam_id);

        // Ambil semua resep terkait rekam medis
        $resepList = $this->resepModel->where('rm_id', $rekam_id)->findAll();

SELECT *
FROM `pembayaran`
WHERE `no_bayar` = 'BYR-29-05-2025-01'
 LIMIT 1
UPDATE `pembayaran` SET `pasien_id` = '4', `tindakan_id` = NULL, `obat_id` = '3', `resep_id` = '46', `no_bayar` = 'BYR-29-05-2025-01', `cara_pembayaran` = 'Mandiri', `nama_petugas` = 'Drg. Adinda Maharani', `total_bayar` = 10000, `uang_bayar` = 10000, `tanggal_bayar` = '2025-05-29'
WHERE `pembayaran`.`id_bayar` IN ('19')
---
        ];
        // dd($dataPembayaran);

        $pembayaranLama = $this->pembayaranModel
            ->where('no_bayar', $no_bayar)
            ->first();

        if ($pembayaranLama) {
            $id_bayar = $pembayaranLama['id_bayar'];
            $this->pembayaranModel->update($id_bayar, $dataPembayaran);

UPDATE `antrian` SET `status_bayar` = 'lunas', `updated_at` = '2025-05-29 14:39:46'
WHERE `antrian`.`id_antrian` IN ('27')
UPDATE `resep` SET `status_resep` = 'sudah_diberikan'
WHERE `resep`.`id_resep` IN (46)
---


        // Update status antrian jadi 'lunas'
        $this->antrianModel->update($id_antrian, ['status_bayar' => 'lunas']);
        $resep_id = !empty($resepList) ? (int) $resepList[0]['id_resep'] : 0;

        if ($resep_id) {
            $this->resepModel->update($resep_id, ['status_resep' => 'sudah_diberikan']);

SELECT *
FROM `pembayaran`
WHERE `no_bayar` = 'BYR-29-05-2025-01'
 LIMIT 1
---
    public function cetakStruk($no_bayar)
    {
        $pembayaran = $this->pembayaranModel
            ->where('no_bayar', $no_bayar)
            ->first();