app/Controllers/DokterController.php

SELECT *
FROM `dokter`
SELECT *
FROM `dokter`
WHERE `kode_dokter` LIKE 'DKT%' ESCAPE '!'
ORDER BY `id_dokter` DESC
 LIMIT 1
---
    public function index()
    {
        $dokter = $this->dokterModel->findAll();

        $last = $this->dokterModel->like('kode_dokter', 'DKT', 'after')
            ->orderBy('id_dokter', 'DESC')
            ->first();