app/Controllers/DokterController.php

SELECT `rekam_medis`.*, `pasien`.`nama` AS `nama_pasien`, `pasien`.`tanggal_lahir`, `tb_dokter`.`nama` AS `nama_dokter`, `antrian`.`id` AS `antrian_id`, `antrian`.`nomor_antrian`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id`
LEFT JOIN `tb_dokter` ON `rekam_medis`.`dokter_id` = `tb_dokter`.`id`
LEFT JOIN `antrian` ON `rekam_medis`.`id` = `antrian`.`rm_id`
WHERE `rekam_medis`.`tanggal_periksa` = '2025-03-17'
---
    public function index()
    {
        $tanggalHariIni = date('Y-m-d');

        $rekamMedis = $this->rekamMedisModel
            ->select('rekam_medis.*,
                  pasien.nama AS nama_pasien,
                  pasien.tanggal_lahir,
                  tb_dokter.nama AS nama_dokter,
                  antrian.id AS antrian_id,
                  antrian.nomor_antrian')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id', 'left')
            ->join('tb_dokter', 'rekam_medis.dokter_id = tb_dokter.id', 'left')
            ->join('antrian', 'rekam_medis.id = antrian.rm_id', 'left')
            ->where('rekam_medis.tanggal_periksa', $tanggalHariIni)
            ->findAll();