app/Controllers/DokterController.php

    public function index()
    {
        $rekamMedis = $this->rekamMedisModel->select('rekam_medis.*, pasien.nama AS nama_pasien, pasien.tanggal_lahir, tb_dokter.nama AS nama_dokter')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id', 'left')
            ->join('tb_dokter', 'rekam_medis.dokter_id = tb_dokter.id', 'left')
            ->findAll();
---
SELECT `rekam_medis`.*, `pasien`.`nama` AS `nama_pasien`, `pasien`.`tanggal_lahir`, `tb_dokter`.`nama` AS `nama_dokter`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id`
LEFT JOIN `tb_dokter` ON `rekam_medis`.`dokter_id` = `tb_dokter`.`id`

    public function updateRekamMedis()
    {
        $validationRules = [
            'keluhan'  => 'required',
            'diagnosa' => 'required',
            'tindakan' => 'required',
            'resep'    => 'required',
            'catatan'  => 'required',
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $rekamId = $this->request->getPost('rekam_id');
        $data = $this->request->getPost(['keluhan', 'diagnosa', 'tindakan', 'resep', 'catatan']);

        if ($this->rekamMedisModel->update($rekamId, $data)) {
---
UPDATE `rekam_medis` SET `keluhan` = 'sjkdkjan', `diagnosa` = 'asmdnmsnm', `tindakan` = 'sdmnmasn', `resep` = 'smdnmsn', `catatan` = '-', `updated_at` = '2025-01-23 17:32:16'
WHERE `rekam_medis`.`id` IN ('4')