app/Controllers/LaporanController.php

    public function index()
    {
        $tanggal_awal = $this->request->getPost('tanggal_awal');
        $tanggal_akhir = $this->request->getPost('tanggal_akhir');

        $builder = $this->rekamMedisModel
            ->select('rekam_medis.*, pasien.nama AS nama_pasien, pasien.nik, tb_dokter.nama AS nama_dokter, antrian.tarif')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id', 'left')
            ->join('tb_dokter', 'rekam_medis.dokter_id = tb_dokter.id', 'left')
            ->join('antrian', 'pasien.nik = antrian.nik', 'left');

        if ($tanggal_awal && $tanggal_akhir) {
            $builder->where('rekam_medis.tanggal_periksa >=', $tanggal_awal)
                ->where('rekam_medis.tanggal_periksa <=', $tanggal_akhir);
        }

        $rekamMedis = $builder->findAll();
---
SELECT `rekam_medis`.*, `pasien`.`nama` AS `nama_pasien`, `pasien`.`nik`, `tb_dokter`.`nama` AS `nama_dokter`, `antrian`.`tarif`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id`
LEFT JOIN `tb_dokter` ON `rekam_medis`.`dokter_id` = `tb_dokter`.`id`
LEFT JOIN `antrian` ON `pasien`.`nik` = `antrian`.`nik`
SELECT `rekam_medis`.*, `pasien`.`nama` AS `nama_pasien`, `pasien`.`nik`, `tb_dokter`.`nama` AS `nama_dokter`, `antrian`.`tarif`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id`
LEFT JOIN `tb_dokter` ON `rekam_medis`.`dokter_id` = `tb_dokter`.`id`
LEFT JOIN `antrian` ON `pasien`.`nik` = `antrian`.`nik`
WHERE `rekam_medis`.`tanggal_periksa` >= '2025-03-16'
AND `rekam_medis`.`tanggal_periksa` <= '2025-03-18'