app/Controllers/LaporanController.php

SELECT `rekam_medis`.*, `pasien`.`nama_lengkap` AS `nama_pasien`, `pasien`.`tanggal_lahir`, `pasien`.`id_pasien` AS `pasien_id`, `dokter`.`nama` AS `nama_dokter`, `dokter`.`id_dokter` AS `dokter_id`, `antrian`.`id_antrian` AS `antrian_id`, `antrian`.`nomor_antrian`, `penyakit`.`nama_penyakit`, `tindakan`.`nama_tindakan`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id_pasien`
LEFT JOIN `dokter` ON `rekam_medis`.`dokter_id` = `dokter`.`id_dokter`
LEFT JOIN `penyakit` ON `rekam_medis`.`penyakit_id` = `penyakit`.`id_penyakit`
LEFT JOIN `tindakan` ON `rekam_medis`.`tindakan_id` = `tindakan`.`id_tindakan`
LEFT JOIN `antrian` ON `rekam_medis`.`id_rm` = `antrian`.`rm_id`
SELECT `resep`.*, `obat`.`nama_obat`, `obat`.`harga`
FROM `resep`
LEFT JOIN `obat` ON `obat`.`id_obat` = `resep`.`obat_id`
---
    public function pasien()
    {
        $rekamMedis = $this->rekamMedisModel
            ->select('rekam_medis.*,
        pasien.nama_lengkap AS nama_pasien,
        pasien.tanggal_lahir,
        pasien.id_pasien AS pasien_id,
        dokter.nama AS nama_dokter,
        dokter.id_dokter AS dokter_id,
        antrian.id_antrian AS antrian_id,
        antrian.nomor_antrian,
        penyakit.nama_penyakit,
        tindakan.nama_tindakan')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id_pasien', 'left')
            ->join('dokter', 'rekam_medis.dokter_id = dokter.id_dokter', 'left')
            ->join('penyakit', 'rekam_medis.penyakit_id = penyakit.id_penyakit', 'left')
            ->join('tindakan', 'rekam_medis.tindakan_id = tindakan.id_tindakan', 'left')
            ->join('antrian', 'rekam_medis.id_rm = antrian.rm_id', 'left')
            ->asArray()
            ->findAll();

        // Ambil resep + info obat
        $resepData = $this->resepModel
            ->select('resep.*, obat.nama_obat, obat.harga')
            ->join('obat', 'obat.id_obat = resep.obat_id', 'left')
            ->findAll();

SELECT `antrian`.*, `rekam_medis`.`no_rm`
FROM `antrian`
LEFT JOIN `rekam_medis` ON `antrian`.`rm_id` = `rekam_medis`.`id_rm`
WHERE DATE(antrian.tanggal_periksa) = '2025-05-19'
SELECT *
FROM `dokter`
---
            $resepPerPasien[$r['rm_id']][] = $r;
        }

        $antrian = $this->antrianModel
            ->select('antrian.*, rekam_medis.no_rm')
            ->join('rekam_medis', 'antrian.rm_id = rekam_medis.id_rm', 'left')
            ->where('DATE(antrian.tanggal_periksa)', date('Y-m-d'))
            ->findAll();

        $dokter = $this->dokterModel->findAll();