app/Controllers/PasienController.php

SELECT `pasien`.*, `jenis_kelamin`.`nama_jenis_kelamin`, `agama`.`nama_agama`, `pendidikan`.`nama_pendidikan`
FROM `pasien`
LEFT JOIN `jenis_kelamin` ON `jenis_kelamin`.`id_jenis_kelamin` = `pasien`.`jenis_kelamin_id`
LEFT JOIN `agama` ON `agama`.`id_agama` = `pasien`.`agama_id`
LEFT JOIN `pendidikan` ON `pendidikan`.`id_pendidikan` = `pasien`.`pendidikan_id`
SELECT `rekam_medis`.*, `tindakan`.`nama_tindakan`
FROM `rekam_medis`
LEFT JOIN `tindakan` ON `tindakan`.`id_tindakan` = `rekam_medis`.`tindakan_id`
WHERE `rekam_medis`.`pasien_id` = '1'
ORDER BY `tanggal_periksa` DESC
SELECT `resep`.*, `obat`.`nama_obat`, `obat`.`harga`
FROM `resep`
LEFT JOIN `obat` ON `obat`.`id_obat` = `resep`.`obat_id`
WHERE `rm_id` = '21'
---
    public function index()
    {
        $pasien = $this->pasienModel
            ->select('pasien.*, jenis_kelamin.nama_jenis_kelamin, agama.nama_agama, pendidikan.nama_pendidikan')
            ->join('jenis_kelamin', 'jenis_kelamin.id_jenis_kelamin = pasien.jenis_kelamin_id', 'left')
            ->join('agama', 'agama.id_agama = pasien.agama_id', 'left')
            ->join('pendidikan', 'pendidikan.id_pendidikan = pasien.pendidikan_id', 'left')
            ->findAll();

        // Loop untuk menambahkan rekam medis per pasien
        foreach ($pasien as &$p) {
            $rekam_medis = $this->rekamMedisModel
                ->select('rekam_medis.*, tindakan.nama_tindakan')
                ->join('tindakan', 'tindakan.id_tindakan = rekam_medis.tindakan_id', 'left')
                ->where('rekam_medis.pasien_id', $p['id_pasien'])
                ->orderBy('tanggal_periksa', 'DESC')
                ->findAll();

            foreach ($rekam_medis as &$rm) {
                $resep = $this->resepModel
                    ->select('resep.*, obat.nama_obat, obat.harga')
                    ->join('obat', 'obat.id_obat = resep.obat_id', 'left')
                    ->where('rm_id', $rm['id_rm'])
                    ->findAll();

SELECT *
FROM `jenis_kelamin`
SELECT *
FROM `agama`
SELECT *
FROM `pendidikan`
---
        }


        $data = [
            'tittle' => 'Data Pasien',
            'pasien' => $pasien,
            'jenis_kelamin' => $this->jenisKelaminModel->findAll(),
            'agama' => $this->agamaModel->findAll(),
            'pendidikan' => $this->pendidikanModel->findAll(),
            // 'resepPerRM' => $resepPerPasien,
        ];