app/Controllers/PasienController.php

SELECT *
FROM `pasien`
---
    public function index()
    {
        $data = [
            'tittle' => 'Data Pasien',
            'pasien' => $this->pasienModel->findAll(),