app/Controllers/RmController.php

SELECT `rekam_medis`.*, `pasien`.`nama_lengkap` AS `nama_pasien`, `pasien`.`tanggal_lahir`, `pasien`.`id_pasien` AS `pasien_id`, `dokter`.`nama` AS `nama_dokter`, `dokter`.`id_dokter` AS `dokter_id`, `antrian`.`id_antrian` AS `antrian_id`, `antrian`.`nomor_antrian`, `penyakit`.`nama_penyakit`, `tindakan`.`nama_tindakan`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id_pasien`
LEFT JOIN `dokter` ON `rekam_medis`.`dokter_id` = `dokter`.`id_dokter`
LEFT JOIN `antrian` ON `rekam_medis`.`id_rm` = `antrian`.`rm_id`
LEFT JOIN `penyakit` ON `rekam_medis`.`penyakit_id` = `penyakit`.`id_penyakit`
LEFT JOIN `tindakan` ON `rekam_medis`.`tindakan_id` = `tindakan`.`id_tindakan`
WHERE `rekam_medis`.`tanggal_periksa` = '2025-05-19'
SELECT *
FROM `penyakit`
SELECT *
FROM `tindakan`
SELECT *
FROM `dokter`
---
    public function index()
    {
        $tanggalHariIni = date('Y-m-d');

        $rekamMedis = $this->rekamMedisModel
            ->select('rekam_medis.*,
                pasien.nama_lengkap AS nama_pasien,
                pasien.tanggal_lahir,
                pasien.id_pasien AS pasien_id,
                dokter.nama AS nama_dokter,
                dokter.id_dokter AS dokter_id,
                antrian.id_antrian AS antrian_id,
                antrian.nomor_antrian,
                penyakit.nama_penyakit,
                tindakan.nama_tindakan,')

            ->join('pasien', 'rekam_medis.pasien_id = pasien.id_pasien', 'left')
            ->join('dokter', 'rekam_medis.dokter_id = dokter.id_dokter', 'left')
            ->join('antrian', 'rekam_medis.id_rm = antrian.rm_id', 'left')
            ->join('penyakit', 'rekam_medis.penyakit_id = penyakit.id_penyakit', 'left')
            ->join('tindakan', 'rekam_medis.tindakan_id = tindakan.id_tindakan', 'left')
            // ->join('resep', 'pasien.id_pasien = resep.pasien_id', 'left')
            ->where('rekam_medis.tanggal_periksa', $tanggalHariIni)
            ->asArray()
            ->findAll();
        $penyakit = $this->penyakitModel->findAll();
        $tindakan = $this->tindakanModel->findAll();
        $dokter = $this->dokterModel->findAll();

SELECT *
FROM `resep`
---
        }


        $resepData = $this->resepModel->findAll();

SELECT `rekam_medis`.*, `pasien`.`nama_lengkap`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id_pasien`
WHERE `rekam_medis`.`id_rm` = '20'
 LIMIT 1
SELECT `rekam_medis`.*, `pasien`.`nama_lengkap`
FROM `rekam_medis`
LEFT JOIN `pasien` ON `rekam_medis`.`pasien_id` = `pasien`.`id_pasien`
WHERE `rekam_medis`.`id_rm` = '10'
 LIMIT 1
SELECT *
FROM `obat`
SELECT `resep`.*, `obat`.`nama_obat`
FROM `resep`
LEFT JOIN `obat` ON `obat`.`id_obat` = `resep`.`obat_id`
WHERE `resep`.`rm_id` = '20'
ORDER BY `tanggal_resep` DESC
SELECT *
FROM `penyakit`
SELECT `resep`.*, `obat`.`nama_obat`
FROM `resep`
LEFT JOIN `obat` ON `obat`.`id_obat` = `resep`.`obat_id`
WHERE `pasien_id` = '1'
ORDER BY `tanggal_resep` DESC
SELECT *
FROM `tindakan`
SELECT *
FROM `formulir_tindakan`
WHERE `pasien_id` = '2'
AND `tindakan_id` = '3'
ORDER BY `tanggal_pelaksanaan` DESC
 LIMIT 1
---
    public function detail()
    {
        $id = $this->request->getGet('id_rm');

        $rekam = $this->rekamMedisModel
            ->select('rekam_medis.*, pasien.nama_lengkap')
            ->join('pasien', 'rekam_medis.pasien_id = pasien.id_pasien', 'left')
            ->where('rekam_medis.id_rm', $id)
            ->asArray()
            ->first();


        if (!$rekam) {
            return redirect()->to(base_url('/rekam-medis'))->with('error', 'Data rekam medis tidak ditemukan.');
        }


        $obatModel = new ObatModel();
        $obatList = $obatModel->findAll();

        $resepPasien = $this->resepModel
            ->select('resep.*, obat.nama_obat')
            ->join('obat', 'obat.id_obat = resep.obat_id', 'left')
            ->where('resep.rm_id', $rekam['id_rm'])
            ->orderBy('tanggal_resep', 'DESC')
            ->findAll();

        $penyakit = $this->penyakitModel->findAll();
        $tindakan = $this->tindakanModel->findAll();

        // Ambil berdasarkan pasien_id dan tindakan_id
        $formTindakan = $this->formulirTindakanModel
            ->where('pasien_id', $rekam['pasien_id'])
            ->where('tindakan_id', $rekam['tindakan_id'])
            ->orderBy('tanggal_pelaksanaan', 'DESC')
            ->first();