app/Models/AntrianModel.php

    public function getAntrianHariIni()
    {
        // Ambil data antrian berdasarkan tanggal hari ini
        return $this->db->table('antrian')
            ->where('DATE(tanggal_periksa)', date('Y-m-d'))
            ->orderBy('tanggal_periksa', 'asc')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `antrian`
WHERE DATE(tanggal_periksa) = '2025-02-26'
ORDER BY `tanggal_periksa` ASC