app/Models/PasienModel.php

    public function getPasienByNik($nik)
    {
        return $this->where('nik', $nik)->first();
---
SELECT *
FROM `pasien`
WHERE `nik` = '238475928378'
 LIMIT 1