app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `username` = 'manager'
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();